In [26]:
import pandas as pd
people={
    "first":["Corey","Jane","John"],
    "last":["Schafer","Doe","Doe"],
    "email":["coreyschafer@gmail.com","janedoe@gmail.com","johndoe@gmail.com"]
}
df=pd.DataFrame(people)
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [2]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [3]:
#To modify column name
df.columns=['first_name','last_name','email']

In [4]:
df

  first_name last_name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [7]:
#To make column name as uppercase
df.columns=[x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [8]:
#To replace  underscore with space or vise versa
df.columns=df.columns.str.replace('_',' ')
df

  FIRST NAME LAST NAME                   EMAIL
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [10]:
df.columns=[x.lower() for x in df.columns]
df

  first name last name                   email
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@gmail.com
2       John       Doe       johndoe@gmail.com

In [17]:
# To rename the column 
df.rename(columns={'first name':'first', 'last name':'last'},inplace = True)
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [21]:
#To change the data of cell
df.loc[2]=['John','Smith','johnsmith@gmail.com']
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith     johnsmith@gmail.com

In [29]:
df.loc[2,['last','email']]=['Doe','JohnDoe@gmail.com']

In [30]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [31]:
df.loc[2,'last']='Smith'

In [32]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [33]:
#at and loc both can be use interchangably
df.at[2,'last']='Doe'
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [40]:
filt=(df['email']=='JohnDoe@gmail.com')
df[filt]

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [41]:
df[filt]['last']

2    Doe
Name: last, dtype: object

In [ ]:
# df[filt]['last']='Smith' IT will not work we have to use loc operator

In [43]:
df.loc[filt,'last']='Smith' #This we have already seen

In [44]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       JohnDoe@gmail.com

In [45]:
df['email'].str.lower()

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [46]:
df['email'].str.upper()

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [47]:
df['email']=df['email'].str.lower()

In [48]:
df['email']

0    coreyschafer@gmail.com
1         janedoe@gmail.com
2         johndoe@gmail.com
Name: email, dtype: object

In [49]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [50]:
df['email'].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [52]:
def update_email(email):
    return email.upper()

In [53]:
df['email'].apply(update_email)

0    COREYSCHAFER@GMAIL.COM
1         JANEDOE@GMAIL.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [54]:
df['email']=df['email'].apply(update_email)

In [55]:
df

   first     last                   email
0  Corey  Schafer  COREYSCHAFER@GMAIL.COM
1   Jane      Doe       JANEDOE@GMAIL.COM
2   John    Smith       JOHNDOE@GMAIL.COM

In [56]:
df['email']=df['email'].apply(lambda x: x.lower())

In [57]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John    Smith       johndoe@gmail.com

In [6]:
len(df['email'])

3

In [58]:
df.apply(len)   #rows is the default

first    3
last     3
email    3
dtype: int64

In [60]:
df.apply(len, axis='columns')   #rows is the default

0    3
1    3
2    3
dtype: int64

In [7]:
df.apply(pd.Series.min) # will return lowest character

first                     Corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [8]:
 df.apply(lambda x: x.min())  #will return same result

first                     Corey
last                        Doe
email    coreyschafer@gmail.com
dtype: object

In [9]:
df.applymap(len)

C:\Users\deshmuks\AppData\Local\Temp\ipykernel_15716\1485728669.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     22
1      4     3     17
2      4     3     17

In [10]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [11]:
df.applymap(str.lower)

C:\Users\deshmuks\AppData\Local\Temp\ipykernel_15716\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

   first     last                   email
0  corey  schafer  coreyschafer@gmail.com
1   jane      doe       janedoe@gmail.com
2   john      doe       johndoe@gmail.com

In [12]:
df.applymap(str.upper)

C:\Users\deshmuks\AppData\Local\Temp\ipykernel_15716\382839591.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.upper)

   first     last                   email
0  COREY  SCHAFER  COREYSCHAFER@GMAIL.COM
1   JANE      DOE       JANEDOE@GMAIL.COM
2   JOHN      DOE       JOHNDOE@GMAIL.COM

In [13]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [14]:
df['first'].map({'Corey':'Sanket','Jane':'Aniket'})

0    Sanket
1    Aniket
2       NaN
Name: first, dtype: object

In [15]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [16]:
df['first'].replace({'Corey':'Sanket','Jane':'Aniket'})

0    Sanket
1    Aniket
2      John
Name: first, dtype: object

In [17]:
df

   first     last                   email
0  Corey  Schafer  coreyschafer@gmail.com
1   Jane      Doe       janedoe@gmail.com
2   John      Doe       johndoe@gmail.com

In [21]:
df['first']=df['first'].replace({'Corey':'Sanket','Jane':'Aniket'})

In [22]:
df

    first     last                   email
0  Sanket  Schafer  coreyschafer@gmail.com
1  Aniket      Doe       janedoe@gmail.com
2    John      Doe       johndoe@gmail.com

In [27]:
df=pd.read_csv(r'C:\Users\deshmuks\OneDrive - Landis+Gyr\Desktop\Python\Pandas\survey_results_public.csv')
schema_df=pd.read_csv(r'C:\Users\deshmuks\OneDrive - Landis+Gyr\Desktop\Python\Pandas\survey_results_schema.csv')
pd.set_option('display.max_columns',85)
pd.set_option('display.max_rows',85)

In [ ]:
#Changing the column
df.rename(columns={'ConvertedComp':'SalaryUSD'})

In [29]:
#Changing the column and in db
df.rename(columns={'ConvertedComp':'SalaryUSD'}, inplace=True)

In [30]:
df['SalaryUSD']

0            NaN
1            NaN
2         8820.0
3        61000.0
4            NaN
          ...
88878        NaN
88879        NaN
88880        NaN
88881        NaN
88882        NaN
Name: SalaryUSD, Length: 88883, dtype: float64

In [32]:
df['Hobbyist']

0        Yes
1         No
2        Yes
3         No
4        Yes
        ...
88878    Yes
88879     No
88880     No
88881     No
88882    Yes
Name: Hobbyist, Length: 88883, dtype: object

In [33]:
df['Hobbyist'].map({'Yes':'True','No':'False'})

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: object

In [34]:
df['Hobbyist']=df['Hobbyist'].map({'Yes':'True','No':'False'})  #other one apart from Yes and No get changed to NaN

In [37]:
df['Hobbyist']=df['Hobbyist'].replace({'Yes':'True','No':'False'}) #other one stay same

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: object

In [35]:
df['Hobbyist']

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: object

In [ ]:
df